# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [233]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [234]:
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [235]:
city_unique_df = city_data_df.sort_values(by=['city'], ascending=True)
city_unique_df

                 city  driver_count      type
61        Amandaburgh            12     Urban
9         Barajasview            26     Urban
90      Barronchester            11  Suburban
88        Bethanyland            22  Suburban
115      Bradshawfurt             7     Rural
..                ...           ...       ...
4         West Robert            39     Urban
25   West Samuelburgh            73     Urban
78    Williamsonville             2  Suburban
1        Williamsstad            59     Urban
62       Williamsview            46     Urban

[120 rows x 3 columns]

In [236]:
### Do cities repeat in the orig dataset?
###### Groupby single column in pandas python'''
###### https://www.datasciencemadesimple.com/group-by-count-in-pandas-dataframe-python-2/
city_orig_unique_df = city_data_df.groupby(['city'])['city'].count()
city_orig_unique_df.max(0)

1

In [237]:
ride_data_df.head()

                 city             date   fare       ride_id
0  Lake Jonathanshire  1/14/2019 10:14  13.83  5.739410e+12
1  South Michelleport   3/4/2019 18:24  30.24  2.343910e+12
2  Port Samanthamouth   2/24/2019 4:29  33.44  2.005070e+12
3          Rodneyfort  2/10/2019 23:22  23.44  5.149250e+12
4          South Jack    3/6/2019 4:28  34.58  3.908450e+12

### Merge the DataFrames

In [238]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,4/29/2019 17:04,13.38,8.550370e+12,6,Rural
2371,Lake Latoyabury,1/30/2019 0:05,20.76,9.018730e+12,2,Rural
2372,North Jaime,2/10/2019 21:03,11.11,2.781340e+12,1,Rural
2373,West Heather,5/7/2019 19:22,44.94,4.256850e+12,4,Rural
2374,Newtonview,4/25/2019 10:20,55.84,9.990580e+12,1,Rural

## Deliverable 1: Get a Summary DataFrame

In [239]:
#  1. Get the total rides for each city type
citytype_rides_tot_s = pyber_data_df.groupby(["type"]).count()["ride_id"]
citytype_rides_tot_s

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [302]:
citytype_rides_tot_df = citytype_rides_tot_s.to_frame().reset_index()
citytype_rides_tot_df.columns = ['type', 'rides']
citytype_rides_tot_df

       type  rides
0     Rural    125
1  Suburban    625
2     Urban   1625

In [241]:
citytype_rides_tot_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   type     3 non-null      object
 1   ride_id  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [242]:
###### Do cities repeat in the merged dataset?
###### Groupby single column in pandas python
###### df1.groupby(['State'])['Sales'].count()
###### https://www.datasciencemadesimple.com/group-by-count-in-pandas-dataframe-python-2/
city_mrg_unique_df = pyber_data_df.groupby(['city'])['city'].count()
city_mrg_unique_df

city
Amandaburgh         18
Barajasview         22
Barronchester       16
Bethanyland         18
Bradshawfurt        10
                    ..
West Robert         31
West Samuelburgh    25
Williamsonville     14
Williamsstad        23
Williamsview        20
Name: city, Length: 120, dtype: int64

In [243]:
###### Personal challenge:
###### Create new df from merged df, to create
###### new driver tot df. As if merged df was all 
###### that was available.
sub_drivers_tot_s = (pyber_data_df.groupby(["city", "type"]).max()["driver_count"])
sub_drivers_tot_s

city              type
Amandaburgh       Urban       12
Barajasview       Urban       26
Barronchester     Suburban    11
Bethanyland       Suburban    22
Bradshawfurt      Rural        7
                              ..
West Robert       Urban       39
West Samuelburgh  Urban       73
Williamsonville   Suburban     2
Williamsstad      Urban       59
Williamsview      Urban       46
Name: driver_count, Length: 120, dtype: int64

In [244]:
sub_drivers_tot_df = sub_drivers_tot_s.to_frame().reset_index()
sub_drivers_tot_df

                 city      type  driver_count
0         Amandaburgh     Urban            12
1         Barajasview     Urban            26
2       Barronchester  Suburban            11
3         Bethanyland  Suburban            22
4        Bradshawfurt     Rural             7
..                ...       ...           ...
115       West Robert     Urban            39
116  West Samuelburgh     Urban            73
117   Williamsonville  Suburban             2
118      Williamsstad     Urban            59
119      Williamsview     Urban            46

[120 rows x 3 columns]

In [245]:
sub_drivers_tot_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city          120 non-null    object
 1   type          120 non-null    object
 2   driver_count  120 non-null    int64
dtypes: int64(1), object(2)
memory usage: 2.9+ KB

In [246]:
# ###### Personal challenge:
# ###### Create new df from merged df, to create
# ###### new driver tot df. As if merged df was all 
# ###### that was available.

# # 2. Get the total drivers for each city type
# # sub_drivers_tot = pyber_data_df.groupby(["city", "type"]).max()["driver_count"]
# sub_drivers_tot_df = pd.DataFrame(pyber_data_df.groupby(["city", "type"]).max()["driver_count"])
# sub_drivers_tot_df.info()

In [247]:
# 2. Get the total drivers for each city type
citytype_drivers_tot_s = sub_drivers_tot_df.groupby(["type"]).sum()["driver_count"]
citytype_drivers_tot_s

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [248]:
citytype_drivers_tot_df = citytype_drivers_tot_s.to_frame().reset_index()
citytype_drivers_tot_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   type          3 non-null      object
 1   driver_count  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [249]:
#  3. Get the total amount of fares for each city type
citytype_fares_tot_s = pyber_data_df.groupby(["type"]).sum()["fare"]
citytype_fares_tot_s

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [250]:
citytype_fares_tot_df = citytype_fares_tot_s.to_frame().reset_index()
citytype_fares_tot_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   type    3 non-null      object
 1   fare    3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes

In [251]:
#  4. Get the average fare per ride for each city type. 
citytype_fare_x_ride_s = citytype_fares_tot_s / citytype_rides_tot_s
citytype_fare_x_ride_s

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [291]:
citytype_fare_x_ride_df = citytype_fare_x_ride_s.to_frame().reset_index()
# https://www.statology.org/pandas-rename-columns/
# df.rename(columns = {'old_col1':'new_col1', 'old_col2':'new_col2'}, inplace = True)
citytype_fare_x_ride_df.columns = ['type', 'fare_x_ride']
citytype_fare_x_ride_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   type         3 non-null      object
 1   fare_x_ride  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes

In [253]:
# 5. Get the average fare per driver for each city type. 
citytype_fare_x_driver_s = citytype_fares_tot_s / citytype_drivers_tot_s
citytype_fare_x_driver_s

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [292]:
citytype_fare_x_driver_df = citytype_fare_x_driver_s.to_frame().reset_index()
citytype_fare_x_driver_df.columns = ['type', 'fare_x_driver']
citytype_fare_x_driver_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   type           3 non-null      object
 1   fare_x_driver  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes

In [301]:
#  6. Create a PyBer summary DataFrame. 
# df.join(other.set_index('key'), on='key')
citytype_tots = citytype_rides_tot_df.join(
    citytype_drivers_tot_df.set_index("type"), on=("type")).join(
    citytype_fares_tot_df.set_index("type"), on=("type")).join(
    citytype_fare_x_ride_df.set_index("type"), on=("type")).join(
    citytype_fare_x_driver_df.set_index("type"), on=("type"))
citytype_tots

       type  ride_id  driver_count      fare  fare_x_ride  fare_x_driver
0     Rural      125            78   4327.93    34.623440      55.486282
1  Suburban      625           490  19356.33    30.970128      39.502714
2     Urban     1625          2405  39854.38    24.525772      16.571468

In [9]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [10]:
#  8. Format the columns.

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [11]:
# 1. Read the merged DataFrame

In [12]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

In [13]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [14]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')